---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsHasCycle
source: html/7f446cdf-d926-8466-0d0a-cb1074338fe8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupsHasCycle Property

Can't create Group because it contains multiple copies of same Group.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupsHasCycle { get; }
```